tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
#define USART_BAUD 115200
#define USART_BUFFER_SIZE 128

static void put_char(uint8_t byte)
{
#ifdef STM32

#ifdef STM32F103xB
    USART1->DR = (int)(byte);
    while (!(USART1->SR & USART_SR_TXE));
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    USART1->RDR = (int)(byte);
    while (!(USART1->ISR & USART_ISR_TXE));
#endif  // #ifdef STM32F767xx

#else  // #ifdef STM32

	uart_session->put_char(byte);

#endif  // #ifdef STM32
}

typedef struct {
    uint8_t buffer[USART_BUFFER_SIZE];
    uint8_t head_pos;
    uint8_t tail_pos;
} rx_buffer_t;

volatile rx_buffer_t uart_buffer = { { 0 }, 0, 0 };

static void buffer_char(uint8_t c)
{
    __disable_irq();

    int i = (uart_buffer.head_pos + 1) % USART_BUFFER_SIZE;
    
    if (i != uart_buffer.tail_pos) {
        uart_buffer.buffer[uart_buffer.head_pos] = c;
        uart_buffer.head_pos = i;
    }

    __enable_irq();
}

static uint8_t get_char(uint8_t *c)
{
    __disable_irq();

    if(uart_buffer.head_pos == uart_buffer.tail_pos) {
        __enable_irq();
        return 0;
    }
    
    *c = uart_buffer.buffer[uart_buffer.tail_pos];
    uart_buffer.tail_pos = (uart_buffer.tail_pos + 1) % USART_BUFFER_SIZE;
    
    __enable_irq();
    return 1;
}

volatile uint32_t *DWT_CYCCNT = (uint32_t *)0xE0001004;

static void parse(void);
static void set_current_run_mode(run_mode mode);

static struct cycle_buffer {

	struct cycle_entry {
		int32_t target_pos_z;
		int32_t stepper_mul_z;
		int32_t stepper_div_z;

		int32_t target_pos_x;
		int32_t stepper_mul_x;
		int32_t stepper_div_x;

		int32_t target_pos_d;
		int32_t stepper_mul_d;
		int32_t stepper_div_d;

		bool wait_for_index_zero;
	};

	void reset() {
		buf_pos = 0;
		buf_index = 0;
		memset(&entry,0,sizeof(entry));
		next();
	}

	void clear() {
		buf_pos = 0;
		buf_len = 0;
		buf_index = 0;
		buf_index_length = 0;
		memset(&entry,0,sizeof(entry));
	}
	
	const cycle_entry &current() const {
		return entry;
	}
	
	uint32_t index() const {
		return buf_index - 1;
	}

	uint32_t index_length() const {
		return buf_index_length;
	}
	
	bool empty() const {
		return buf_len == 0;
	}
	
	bool atend() const {
		return buf_pos >= buf_len;
	}
	
	bool atlimit() const {
		return buf_len >= (sizeof(buf) - sizeof(entry));
	}
	
	#define WAIT_FOR_ZERO   0x000001

	#define Z_TARGET_CHG    0x000002
	#define X_TARGET_CHG    0x000004
	#define D_TARGET_CHG    0x000008

	#define Z_MULDIV_CHG    0x000010
	#define X_MULDIV_CHG    0x000020
	#define D_MULDIV_CHG    0x000040

	#define Z_TARGET_MSK    0x000300
	#define Z_TARGET_32_FLG 0x000100
	#define Z_TARGET_24_FLG 0x000200
	#define Z_TARGET_16_FLG 0x000300

	#define Z_MULDIV_MSK    0x000C00
	#define Z_MULDIV_32_FLG 0x000400
	#define Z_MULDIV_24_FLG 0x000800
	#define Z_MULDIV_16_FLG 0x000C00

	#define X_TARGET_MSK    0x003000
	#define X_TARGET_32_FLG 0x001000
	#define X_TARGET_24_FLG 0x002000
	#define X_TARGET_16_FLG 0x003000

	#define X_MULDIV_MSK    0x00C000
	#define X_MULDIV_32_FLG 0x004000
	#define X_MULDIV_24_FLG 0x008000
	#define X_MULDIV_16_FLG 0x00C000

	#define D_TARGET_MSK    0x030000
	#define D_TARGET_32_FLG 0x010000
	#define D_TARGET_24_FLG 0x020000
	#define D_TARGET_16_FLG 0x030000

	#define D_MULDIV_MSK    0x0C0000
	#define D_MULDIV_32_FLG 0x040000
	#define D_MULDIV_24_FLG 0x080000
	#define D_MULDIV_16_FLG 0x0C0000

	void next() {
		uint32_t flags = 
			(uint32_t(buf[buf_pos+0])<<16)|
			(uint32_t(buf[buf_pos+1])<< 8)|
			(uint32_t(buf[buf_pos+2])<< 0);
		buf_pos += 3;
		
		entry.wait_for_index_zero = (flags & WAIT_FOR_ZERO) != 0;

		if ((flags & Z_TARGET_CHG) != 0) {
			if ((flags & Z_TARGET_MSK) == Z_TARGET_32_FLG) {
				entry.target_pos_z = read_int32();
			} else if ((flags & Z_TARGET_MSK) == Z_TARGET_24_FLG) {
				entry.target_pos_z = read_int24();
			} else if ((flags & Z_TARGET_MSK) == Z_TARGET_16_FLG) {
				entry.target_pos_z = read_int16();
			} else {
				entry.target_pos_z = 0;
			}
		}

		if ((flags & X_TARGET_CHG) != 0) {
			if ((flags & X_TARGET_MSK) == X_TARGET_32_FLG) {
				entry.target_pos_x = read_int32();
			} else if ((flags & X_TARGET_MSK) == X_TARGET_24_FLG) {
				entry.target_pos_x = read_int24();
			} else if ((flags & X_TARGET_MSK) == X_TARGET_16_FLG) {
				entry.target_pos_x = read_int16();
			} else {
				entry.target_pos_x = 0;
			}
		}

		if ((flags & D_TARGET_CHG) != 0) {
			if ((flags & D_TARGET_MSK) == D_TARGET_32_FLG) {
				entry.target_pos_d = read_int32();
			} else if ((flags & D_TARGET_MSK) == D_TARGET_24_FLG) {
				entry.target_pos_d = read_int24();
			} else if ((flags & D_TARGET_MSK) == D_TARGET_16_FLG) {
				entry.target_pos_d = read_int16();
			} else {
				entry.target_pos_d = 0;
			}
		}

		if ((flags & Z_MULDIV_CHG) != 0) {
			if ((flags & Z_MULDIV_MSK) == Z_MULDIV_32_FLG) {
				entry.stepper_mul_z = read_int32();
				entry.stepper_div_z = read_int32();
			} else if ((flags & Z_MULDIV_MSK) == Z_MULDIV_24_FLG) {
				entry.stepper_mul_z = read_int24();
				entry.stepper_div_z = read_int24();
			} else if ((flags & Z_MULDIV_MSK) == Z_MULDIV_16_FLG) {
				entry.stepper_mul_z = read_int16();
				entry.stepper_div_z = read_int16();
			} else {
				entry.stepper_mul_z = 0;
				entry.stepper_div_z = 0;
			}
		}

		if ((flags & X_MULDIV_CHG) != 0) {
			if ((flags & X_MULDIV_MSK) == X_MULDIV_32_FLG) {
				entry.stepper_mul_x = read_int32();
				entry.stepper_div_x = read_int32();
			} else if ((flags & X_MULDIV_MSK) == X_MULDIV_24_FLG) {
				entry.stepper_mul_x = read_int24();
				entry.stepper_div_x = read_int24();
			} else if ((flags & X_MULDIV_MSK) == X_MULDIV_16_FLG) {
				entry.stepper_mul_x = read_int16();
				entry.stepper_div_x = read_int16();
			} else {
				entry.stepper_mul_x = 0;
				entry.stepper_div_x = 0;
			}
		}

		if ((flags & D_MULDIV_CHG) != 0) {
			if ((flags & D_MULDIV_MSK) == D_MULDIV_32_FLG) {
				entry.stepper_mul_d = read_int32();
				entry.stepper_div_d = read_int32();
			} else if ((flags & D_MULDIV_MSK) == D_MULDIV_24_FLG) {
				entry.stepper_mul_d = read_int24();
				entry.stepper_div_d = read_int24();
			} else if ((flags & D_MULDIV_MSK) == D_MULDIV_16_FLG) {
				entry.stepper_mul_d = read_int16();
				entry.stepper_div_d = read_int16();
			} else {
				entry.stepper_mul_d = 0;
				entry.stepper_div_d = 0;
			}
		}

#ifndef STM32
		printf("POS:%08d IDX:%04d TZ:%08d TX:%08d TD:%08d SZ:%08d SX:%08d SD:%08d DZ:%08d DX:%08d DD:%08d\n",
			buf_pos,
			buf_index,

