tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
			current().target_pos_z,
			current().target_pos_x,
			current().target_pos_d,
			
			current().stepper_mul_z,
			current().stepper_mul_x,
			current().stepper_mul_d,
			
			current().stepper_div_z,
			current().stepper_div_x,
			current().stepper_div_d
		);
#endif  // #ifndef STM32
		
		buf_index ++;
	}

	void push(const cycle_entry &push_entry) {
		uint32_t flags = 0;
		
		if (push_entry.target_pos_z != entry.target_pos_z ) {
			flags |= Z_TARGET_CHG;
			if (push_entry.target_pos_z) {
				if ((abs(push_entry.target_pos_z) >> 23) != 0) {
					flags |= Z_TARGET_32_FLG;
				} else if ((abs(push_entry.target_pos_z) >> 15) != 0) {
					flags |= Z_TARGET_24_FLG;
				} else {
					flags |= Z_TARGET_16_FLG;
				}
			}
		}

		if (push_entry.target_pos_x != entry.target_pos_x ) {
			flags |= X_TARGET_CHG;
			if (push_entry.target_pos_x) {
				if ((abs(push_entry.target_pos_x) >> 23) != 0) {
					flags |= X_TARGET_32_FLG;
				} else if ((abs(push_entry.target_pos_x) >> 15) != 0) {
					flags |= X_TARGET_24_FLG;
				} else {
					flags |= X_TARGET_16_FLG;
				}
			}
		}

		if (push_entry.target_pos_d != entry.target_pos_d ) {
			flags |= D_TARGET_CHG;
			if (push_entry.target_pos_d) {
				if ((abs(push_entry.target_pos_d) >> 23) != 0) {
					flags |= D_TARGET_32_FLG;
				} else if ((abs(push_entry.target_pos_d) >> 15) != 0) {
					flags |= D_TARGET_24_FLG;
				} else {
					flags |= D_TARGET_16_FLG;
				}
			}
		}
		
		if (push_entry.stepper_mul_z != entry.stepper_mul_z ||
			push_entry.stepper_div_z != entry.stepper_div_z ) {
			flags |= Z_MULDIV_CHG;
			if (push_entry.stepper_mul_z || push_entry.stepper_div_z) {
				if (((abs(push_entry.stepper_mul_z) | abs(push_entry.stepper_div_z)) >> 23) != 0) {
					flags |= Z_MULDIV_32_FLG;
				} else if (((abs(push_entry.stepper_mul_z) | abs(push_entry.stepper_div_z)) >> 15) != 0) {
					flags |= Z_MULDIV_24_FLG;
				} else {
					flags |= Z_MULDIV_16_FLG;
				}
			}
		}

		if (push_entry.stepper_mul_x != entry.stepper_mul_x ||
			push_entry.stepper_div_x != entry.stepper_div_x ) {
			flags |= X_MULDIV_CHG;
			if (push_entry.stepper_mul_x || push_entry.stepper_div_x) {
				if (((abs(push_entry.stepper_mul_x) | abs(push_entry.stepper_div_x)) >> 23) != 0) {
					flags |= X_MULDIV_32_FLG;
				} else if (((abs(push_entry.stepper_mul_x) | abs(push_entry.stepper_div_x)) >> 15) != 0) {
					flags |= X_MULDIV_24_FLG;
				} else {
					flags |= X_MULDIV_16_FLG;
				}
			}
		}
		
		if (push_entry.stepper_mul_d != entry.stepper_mul_d ||
			push_entry.stepper_div_d != entry.stepper_div_d ) {
			flags |= D_MULDIV_CHG;
			if (push_entry.stepper_mul_d || push_entry.stepper_div_d) {
				if (((abs(push_entry.stepper_mul_d) | abs(push_entry.stepper_div_d)) >> 23) != 0) {
					flags |= D_MULDIV_32_FLG;
				} else if (((abs(push_entry.stepper_mul_d) | abs(push_entry.stepper_div_d)) >> 15) != 0) {
					flags |= D_MULDIV_24_FLG;
				} else {
					flags |= D_MULDIV_16_FLG;
				}
			}
		}

		flags |= push_entry.wait_for_index_zero ? WAIT_FOR_ZERO : 0;
		
		buf[buf_len++] = (flags >> 16) & 0xFF;
		buf[buf_len++] = (flags >>  8) & 0xFF;
		buf[buf_len++] = (flags >>  0) & 0xFF;

		if ((flags & Z_TARGET_MSK) == Z_TARGET_32_FLG) {
			write_int32(push_entry.target_pos_z);
		} else if ((flags & Z_TARGET_MSK) == Z_TARGET_24_FLG) {
			write_int24(push_entry.target_pos_z);
		} else if ((flags & Z_TARGET_MSK) == Z_TARGET_16_FLG) {
			write_int16(push_entry.target_pos_z);
		}

		if ((flags & X_TARGET_MSK) == X_TARGET_32_FLG) {
			write_int32(push_entry.target_pos_x);
		} else if ((flags & X_TARGET_MSK) == X_TARGET_24_FLG) {
			write_int24(push_entry.target_pos_x);
		} else if ((flags & X_TARGET_MSK) == X_TARGET_16_FLG) {
			write_int16(push_entry.target_pos_x);
		}

		if ((flags & D_TARGET_MSK) == D_TARGET_32_FLG) {
			write_int32(push_entry.target_pos_d);
		} else if ((flags & D_TARGET_MSK) == D_TARGET_24_FLG) {
			write_int24(push_entry.target_pos_d);
		} else if ((flags & D_TARGET_MSK) == D_TARGET_16_FLG) {
			write_int16(push_entry.target_pos_d);
		}
		
		if ((flags & Z_MULDIV_MSK) == Z_MULDIV_32_FLG) {
			write_int32(push_entry.stepper_mul_z);
			write_int32(push_entry.stepper_div_z);
		} else if ((flags & Z_MULDIV_MSK) == Z_MULDIV_24_FLG) {
			write_int24(push_entry.stepper_mul_z);
			write_int24(push_entry.stepper_div_z);
		} else if ((flags & Z_MULDIV_MSK) == Z_MULDIV_16_FLG) {
			write_int16(push_entry.stepper_mul_z);
			write_int16(push_entry.stepper_div_z);
		} 
		
		if ((flags & X_MULDIV_MSK) == X_MULDIV_32_FLG) {
			write_int32(push_entry.stepper_mul_x);
			write_int32(push_entry.stepper_div_x);
		} else if ((flags & X_MULDIV_MSK) == X_MULDIV_24_FLG) {
			write_int24(push_entry.stepper_mul_x);
			write_int24(push_entry.stepper_div_x);
		} else if ((flags & X_MULDIV_MSK) == X_MULDIV_16_FLG) {
			write_int16(push_entry.stepper_mul_x);
			write_int16(push_entry.stepper_div_x);
		} 
		
		if ((flags & D_MULDIV_MSK) == D_MULDIV_32_FLG) {
			write_int32(push_entry.stepper_mul_d);
			write_int32(push_entry.stepper_div_d);
		} else if ((flags & D_MULDIV_MSK) == D_MULDIV_24_FLG) {
			write_int24(push_entry.stepper_mul_d);
			write_int24(push_entry.stepper_div_d);
		} else if ((flags & D_MULDIV_MSK) == D_MULDIV_16_FLG) {
			write_int16(push_entry.stepper_mul_d);
			write_int16(push_entry.stepper_div_d);
		} 
		
		entry = push_entry;

		buf_index_length++;
	}
	
private:

	int32_t read_int32() {
		int32_t res = (int32_t(int8_t(buf[buf_pos+0])) << 24)| 
					  (int32_t(       buf[buf_pos+1] ) << 16)| 
					  (int32_t(       buf[buf_pos+2] ) <<  8)| 
					  (int32_t(       buf[buf_pos+3] ) <<  0); 
		buf_pos += 4;
		return res;
	}

	int32_t read_int24() {
		int32_t res = (int32_t(int8_t(buf[buf_pos+0])) << 16)| 
					  (int32_t(       buf[buf_pos+1] ) <<  8)| 
					  (int32_t(       buf[buf_pos+2] ) <<  0); 
		buf_pos += 3;
		return res;
	}

	int32_t read_int16() {
		int32_t res = (int32_t(int8_t(buf[buf_pos+0])) <<  8) | 
					  (int32_t(       buf[buf_pos+1] ) <<  0); 
		buf_pos += 2;
		return res;
	}
	
