tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
	void write_int32(int32_t val) {
		buf[buf_len++] = (uint32_t(val) >> 24) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >> 16) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  8) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  0) & 0xFF;
	}

	void write_int24(int32_t val) {
		buf[buf_len++] = (uint32_t(val) >> 16) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  8) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  0) & 0xFF;
	}

	void write_int16(int16_t val) {
		buf[buf_len++] = (uint32_t(val) >>  8) & 0xFF;
		buf[buf_len++] = (uint32_t(val) >>  0) & 0xFF;
	}

	cycle_entry entry;

#ifdef STM32

#ifdef STM32F103xB
	uint8_t buf[16384];
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
	uint8_t buf[262144];
#endif  // #ifdef STM32F767xx

#else  // #ifdef STM32
	uint8_t buf[16384];
#endif   // #ifdef STM32

	uint32_t buf_index;
	uint32_t buf_index_length;

	uint32_t buf_pos;
	uint32_t buf_len;
} cycle_buffer;

static inline void calc_step(int32_t &stepper_target_pos, int32_t absolute_actual_pos, int32_t stepper_follow_mul, int32_t stepper_follow_div, int32_t stepper_off) {
	if (stepper_follow_mul == 0) {
		stepper_target_pos = stepper_off;      
	} else {
		int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul);
		int32_t v = stepper_follow_div;
		stepper_target_pos = divls(int32_t(u>>32),uint32_t(u), v); 
		stepper_target_pos += stepper_off;
	}
}

static inline void reload_cycle() {
	auto &e = cycle_buffer.current();
	
	stepper_follow_mul_z = e.stepper_mul_z;
	stepper_follow_mul_x = e.stepper_mul_x;
	stepper_follow_mul_d = e.stepper_mul_d;
	
	stepper_follow_div_z = e.stepper_div_z;
	stepper_follow_div_x = e.stepper_div_x;
	stepper_follow_div_d = e.stepper_div_d;

	stepper_end_pos_z = e.target_pos_z;
	if (stepper_actual_pos_z == stepper_end_pos_z) {
		stepper_follow_mul_z = 0;
	} else if (stepper_actual_pos_z > stepper_end_pos_z) {
		stepper_follow_mul_z = -abs(stepper_follow_mul_z);
	} else {
		stepper_follow_mul_z = +abs(stepper_follow_mul_z);
	}

	stepper_end_pos_x = e.target_pos_x;
	if (stepper_actual_pos_x == stepper_end_pos_x) {
		stepper_follow_mul_x = 0;
	} else if (stepper_actual_pos_x > stepper_end_pos_x) {
		stepper_follow_mul_x = -abs(stepper_follow_mul_x);
	} else {
		stepper_follow_mul_x = +abs(stepper_follow_mul_x);
	}

	stepper_end_pos_d = e.target_pos_d;
	if (stepper_actual_pos_d == stepper_end_pos_d) {
		stepper_follow_mul_d = 0;
	} else if (stepper_actual_pos_d > stepper_end_pos_d) {
		stepper_follow_mul_d = -abs(stepper_follow_mul_d);
	} else {
		stepper_follow_mul_d = +abs(stepper_follow_mul_d);
	}

	if (e.wait_for_index_zero) {
		wait_for_index_zero = 1;
		index_zero_occured = 0;
	}
}

static void set_zero_pos()
{
    // Protect against TIM3 IRQ race
    __disable_irq();
    absolute_pos = 0;
    absolute_pos_start_offset = 0;
    stepper_actual_pos_z = 0;
    stepper_actual_pos_x = 0;
    stepper_actual_pos_d = 0;
    stepper_off_z = 0;
    stepper_off_x = 0;
    stepper_off_d = 0;
    wait_for_index_zero = 1;
    index_zero_occured = 0;
    __enable_irq();
}

#ifdef __cplusplus
extern "C" {
#endif  // #ifdef __cplusplus

void HardFault_Handler(void)
{
#ifdef STM32
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
#endif  // #ifdef STM32
}

void BusFault_Handler(void)
{
#ifdef STM32
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
#endif  // #ifdef STM32
}

void SysTick_Handler(void)
{
    absolute_tick++;
    
    parse();

#ifdef STM32
    led_delay_count = ( (led_delay_count + 1) % LED_DELAY_MS );
    if(led_delay_count == 0) {
        led_state       = led_state_next;
        led_state_next  = led_idle;
    }
    
    IWDG->KR  = 0xAAAA;

#else  // #ifdef STM32
	static int32_t counter = 0;
	if (++counter == 500) {
		counter = 0;

		printf("Z:%08d X:%08d D:%08d A:%08d I:%08d T:%08d R:%08d\n", 
			stepper_actual_pos_z, 
			stepper_actual_pos_x, 
			stepper_actual_pos_d,
			
			absolute_pos,
			absolute_idx,
			absolute_tick,
			
			current_run_mode
			
		);
	}
#endif  // #ifdef STM32
}

void USART1_IRQHandler(void)
{
#ifdef STM32

#ifdef STM32F103xB
    uint8_t in_char = (USART1->DR & 0xFF);
    buffer_char(in_char);
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    uint8_t in_char = (USART1->RDR & 0xFF);
    buffer_char(in_char);
#endif  // #ifdef STM32F767xx

#endif  // #ifdef STM32
}

void EXTI1_IRQHandler(void)
{
    // Core critical section, nothing shall happen here
    __disable_irq();

    int16_t cnt = qep_counter();
    set_qep_counter(0);

    absolute_pos += cnt;

    if (cnt < 0) {
        absolute_idx--;
    } else {
        absolute_idx++;
    }

#ifdef STM32
    EXTI->PR |= EXTI_PR_PR1;
#endif  // #ifdef STM32

    if (cnt == 2880 || cnt == -2880) {
        index_zero_occured = 1;
    }

    static int32_t last_absolute_tick = 0;
    current_index_delta = abs(absolute_tick - last_absolute_tick);
    last_absolute_tick = absolute_tick;
    __enable_irq();
}

void TIM2_IRQHandler(void)
{
    static int32_t stepper_dir_z = 0; // direction is undefined by default
    static int32_t stepper_dir_x = 0; // direction is undefined by default
    static int32_t stepper_dir_d = 0; // direction is undefined by default

#ifdef STM32
    if ((TIM2->SR & TIM_SR_UIF)) {
        TIM2->SR &= ~(TIM_SR_UIF);

        *DWT_CYCCNT = 0;
#endif  // #ifdef STM32

        // Do nothing if we are in stop sync mode
        if (current_run_mode == run_mode_none ||
            current_run_mode == run_mode_idle) {
            return;
        }
        
        // Protect against TIM3 IRQ race
        __disable_irq();
        int16_t cnt = qep_counter();
        int32_t absolute_actual_pos = absolute_pos;

        absolute_actual_pos += cnt - absolute_pos_start_offset;

        if (wait_for_index_zero) {
            if (index_zero_occured) {
                index_zero_occured = 0;
                wait_for_index_zero = 0;
                absolute_pos_start_offset = 0;
                absolute_pos = cnt;
                absolute_actual_pos = 0;
                stepper_off_z = stepper_actual_pos_z;
                stepper_off_x = stepper_actual_pos_x;
                stepper_off_d = stepper_actual_pos_d;
            } else {
                // Do nothing until we hit index zero
                __enable_irq();
                return;
            }
        }
        __enable_irq();

        static uint32_t flip_z = 0;
        static uint32_t flip_x = 0;
        static uint32_t flip_d = 0;

