tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
		int32_t stepper_target_pos_z = stepper_actual_pos_z;
		int32_t stepper_target_pos_x = stepper_actual_pos_x;
		int32_t stepper_target_pos_d = stepper_actual_pos_d;

		if (flip_z || flip_x || flip_d) switch (current_run_mode) {
			case    run_mode_follow_zxd: {
						if (flip_z) {
							calc_step(stepper_target_pos_z, absolute_actual_pos, stepper_follow_mul_z, stepper_follow_div_z, stepper_off_z);
						}
						if (flip_x) {
							calc_step(stepper_target_pos_x, absolute_actual_pos, stepper_follow_mul_x, stepper_follow_div_x, stepper_off_x);
						}
						if (flip_d) {
							calc_step(stepper_target_pos_d, absolute_actual_pos, stepper_follow_mul_d, stepper_follow_div_d, stepper_off_d);
						}
					} break;
			case    run_mode_follow_z: {
						if (flip_z) {
							calc_step(stepper_target_pos_z, absolute_actual_pos, stepper_follow_mul_z, stepper_follow_div_z, stepper_off_z);
						}
					} break;
			case    run_mode_follow_x: {
						if (flip_x) {
							calc_step(stepper_target_pos_x, absolute_actual_pos, stepper_follow_mul_x, stepper_follow_div_x, stepper_off_x);
						}
					} break;
			case    run_mode_follow_d: {
						if (flip_d) {
							calc_step(stepper_target_pos_d, absolute_actual_pos, stepper_follow_mul_d, stepper_follow_div_d, stepper_off_d);
						}
					} break;
			case    run_mode_cycle_pause: {
						return;
					} break;
			case    run_mode_cycle: {
						int32_t do_next_cycle_step = 0;

						if (stepper_follow_mul_z == 0) {
							do_next_cycle_step++;
						} else if (stepper_follow_mul_z > 0) {
							if (stepper_actual_pos_z >= stepper_end_pos_z) {
								stepper_follow_mul_z = 0;
								do_next_cycle_step++;
							}   
						} else {
							if (stepper_actual_pos_z <= stepper_end_pos_z) {
								stepper_follow_mul_z = 0;
								do_next_cycle_step++;
							}   
						}

						if (stepper_follow_mul_x == 0) {
							do_next_cycle_step++;
						} else if (stepper_follow_mul_x > 0) {
							if (stepper_actual_pos_x >= stepper_end_pos_x) {
								stepper_follow_mul_x = 0;
								do_next_cycle_step++;
							}   
						} else {
							if (stepper_actual_pos_x <= stepper_end_pos_x) {
								stepper_follow_mul_x = 0;
								do_next_cycle_step++;
							}   
						}

						if (stepper_follow_mul_d == 0) {
							do_next_cycle_step++;
						} else if (stepper_follow_mul_d > 0) {
							if (stepper_actual_pos_d >= stepper_end_pos_d) {
								stepper_follow_mul_d = 0;
								do_next_cycle_step++;
							}   
						} else {
							if (stepper_actual_pos_d <= stepper_end_pos_d) {
								stepper_follow_mul_d = 0;
								do_next_cycle_step++;
							}   
						}

						if (do_next_cycle_step == 3) {
							__disable_irq();
							stepper_off_z = stepper_actual_pos_z;
							stepper_off_x = stepper_actual_pos_x;
							stepper_off_d = stepper_actual_pos_d;
							absolute_pos = 0;
							absolute_pos_start_offset = cnt;
							cycle_buffer.next();
							reload_cycle();
							__enable_irq();
							if (cycle_buffer.atend()) {
								cycle_buffer.reset();
                                reload_cycle();
                                set_current_run_mode(run_mode_cycle_pause);
                                return;
                            }
						}

						if (flip_z) {
							calc_step(stepper_target_pos_z, absolute_actual_pos, stepper_follow_mul_z, stepper_follow_div_z, stepper_off_z);
						}
						if (flip_x) {
							calc_step(stepper_target_pos_x, absolute_actual_pos, stepper_follow_mul_x, stepper_follow_div_x, stepper_off_x);
						}
						if (flip_d) {
							calc_step(stepper_target_pos_d, absolute_actual_pos, stepper_follow_mul_d, stepper_follow_div_d, stepper_off_d);
						}

					} break;
			default: {
					} break;
		}
            
        if (flip_z) {
            int32_t szdelta = stepper_target_pos_z - stepper_actual_pos_z;
            if (szdelta < 0) {
                if (stepper_dir_z != -1) {
                    stepper_dir_z = -1;
                    PIN_DIR_0_Z;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_z--;
                    PIN_PUL_1_Z;
                    flip_z ^= 1;
                }
            } else if (szdelta > 0) {
                if (stepper_dir_z != +1) {
                    stepper_dir_z = +1;
                    PIN_DIR_1_Z;        
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_z++;
                    PIN_PUL_1_Z;
                    flip_z ^= 1;
                }
            }
        } else {
            PIN_PUL_0_Z;
            flip_z ^= 1;
        }

        if (flip_x) {
            int32_t sxdelta = stepper_target_pos_x - stepper_actual_pos_x;
            if (sxdelta < 0) {
                if (stepper_dir_x != -1) {
                    stepper_dir_x = -1;
                    PIN_DIR_0_X;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_x--;
                    PIN_PUL_1_X;
                    flip_x ^= 1;
                }
            } else if (sxdelta > 0) {
                if (stepper_dir_x != +1) {
                    stepper_dir_x = +1;
                    PIN_DIR_1_X;
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_x++;
                    PIN_PUL_1_X;
                    flip_x ^= 1;
                }
            }
        } else {
            PIN_PUL_0_X;
            flip_x ^= 1;
        }

        if (flip_d) {
            int32_t sddelta = stepper_target_pos_d - stepper_actual_pos_d;
            if (sddelta < 0) {
                if (stepper_dir_d != -1) {
                    stepper_dir_d = -1;
                    // wait until next cycle to do the pulse
                } else {
                    stepper_actual_pos_d--;
                    flip_d ^= 1;
                }
            } else if (sddelta > 0) {
                if (stepper_dir_d != +1) {
                    stepper_dir_d = +1;
                    // wait until next cycle to do the pulse
                } else {
                    // now do the actual pulse
                    stepper_actual_pos_d++;
                    flip_d ^= 1;
                }
            }
        } else {
            flip_d ^= 1;
        }
        
#ifdef STM32
        cycle_counter = *DWT_CYCCNT;
    }
#endif  // #ifdef STM32
}

void TIM3_IRQHandler(void)
{
#ifdef STM32
    if ((TIM3->SR & TIM_SR_UIF)) {
        TIM3->SR &= ~(TIM_SR_UIF);
    }
#endif  // #ifdef STM32
}

#ifdef __cplusplus
} // extern "C" {
#endif  // #ifdef __cplusplus

static void maybe_enable_steppers()
{
    if (current_run_mode == run_mode_idle) {
        // Z axis
        PIN_ENA_1_Z; // set to high disables driver
        // X axis
        PIN_ENA_1_X; // set to high disables driver
        return;
    }
    if (current_run_mode == run_mode_none) {
        switch (previous_run_mode) {
            case    run_mode_follow_z: {
                        // X axis 
                        PIN_ENA_1_X; // set to high disables driver
                    } break;
            case    run_mode_follow_x: {
                        // Z axis
                        PIN_ENA_1_Z; // set to high disables driver
                    } break;
            case    run_mode_follow_zxd: {
                        // X axis
                        PIN_ENA_1_X; // set to high disables driver
                        //Z axis
                        PIN_ENA_1_Z; // set to high disables driver
                    } break;
            default: {
                        // Z axis
                        PIN_ENA_1_Z; // set to high disables driver
                        // X axis
                        PIN_ENA_1_X; // set to high disables driver
                    } break;
        }
        return;
    }
    switch (current_run_mode) {
        case    run_mode_follow_z: {
                    // X axis
                    PIN_ENA_1_X; // set to high disables driver
                    // Z axis
                    PIN_ENA_0_Z; // set to low enables driver
                } break;
        case    run_mode_follow_x: {
                    // Z axis
                    PIN_ENA_1_Z; // set to high disables driver
                    // X axis
                    PIN_ENA_0_X; // set to low enables driver
                } break;
        case    run_mode_follow_d: {
                    // Z axis
                    PIN_ENA_1_Z; // set to high disables driver
                    // X axis
                    PIN_ENA_1_X; // set to high enables driver
                } break;
        default: {
                    // X axis
                    PIN_ENA_0_X; // set to low enables driver
                    // Z axis
                    PIN_ENA_0_Z; // set to low enables driver
                } break;
    }
}

