tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
                case 'C': {
                            static int32_t prev_target_z = 0;
                            static int32_t prev_target_x = 0;
                            static int32_t prev_target_d = 0;

                            size_t pos = 1;
                            bool ok_to_run = true;

                            if (buf_pos < (1 + size_of_crc)) {
                                send_invalid_response();
                                break;
                            }

                            if (buf[pos] != 'E' && 
                                buf[pos] != 'C' && 
                                buf[pos] != 'R' && 
                                buf[pos] != 'P') {
                                ok_to_run = false;
                                send_invalid_response();
                                break;
                            }

							// reset
                            if (buf[pos] == 'R') {
                            	cycle_buffer.reset();
                                if (cycle_buffer.empty() ||
                                    cycle_buffer.atend()) {
                                    send_invalid_response();
                                    break;
                                }
                                reload_cycle();
                                set_zero_pos();
								set_current_run_mode(run_mode_cycle_pause);
                                send_ok_response();
                                break;
                            }

							// pause/resume
                            if (buf[pos] == 'P') {
                            	if (current_run_mode == run_mode_cycle_pause) {
	                                set_current_run_mode(run_mode_cycle);
	                            } else if (current_run_mode == run_mode_cycle) {
									set_current_run_mode(run_mode_cycle_pause);
								}
                                send_ok_response();
                                break;
                            }

							// clear
                            if (buf[pos] == 'C') {
                            	cycle_buffer.clear();
                                prev_target_z = 0;
                                prev_target_x = 0;
                                prev_target_d = 0;
                                set_current_run_mode(run_mode_none);
                                send_ok_response();
                                break;
                            }

                            if (buf[pos] != 'E') {
								send_invalid_response();
								break;
							}

							set_current_run_mode(run_mode_cycle_pause);

                            cycle_buffer::cycle_entry entry;

							size_t buf_check_size = 1 + 1 + size_of_crc;
                            if (buf_pos < buf_check_size) {
                                send_invalid_response();
                                break;
                            }

                            buf_check_size += 2;
                            if (buf_pos < buf_check_size) {
                                send_invalid_response();
                                break;
                            }

                            uint8_t flags = uint8_t(parse_hex02((const uint8_t *)&buf[pos])); pos += 2;

							#define SET_Z_FLAG 0x01
							#define SET_X_FLAG 0x02
							#define SET_D_FLAG 0x04
							
							#define WAIT_FLAG  0x10

                            if ((flags & SET_Z_FLAG) != 0) {
								buf_check_size += 24;
								if (buf_pos < buf_check_size) {
									send_invalid_response();
									break;
								}
								entry.target_pos_z = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_mul_z = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_div_z = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
                            	prev_target_z = entry.target_pos_z;
                            } else {
                            	entry.target_pos_z = prev_target_z;
								entry.stepper_mul_z = 0;
								entry.stepper_div_z = 1;
                            }

                            if ((flags & SET_X_FLAG) != 0) {
								buf_check_size += 24;
								if (buf_pos < buf_check_size) {
									send_invalid_response();
									break;
								}
								entry.target_pos_x = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_mul_x = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_div_x = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
                            	prev_target_x = entry.target_pos_x;
							} else {
                            	entry.target_pos_x = prev_target_x;
								entry.stepper_mul_x = 0;
								entry.stepper_div_x = 1;
							}

                            if ((flags & SET_D_FLAG) != 0) {
								buf_check_size += 24;
								if (buf_pos < buf_check_size) {
									send_invalid_response();
									break;
								}
								entry.target_pos_d = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_mul_d = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
								entry.stepper_div_d = int32_t(parse_hex08((const uint8_t *)&buf[pos])); pos += 8;
                            	prev_target_d = entry.target_pos_d;
							} else {
                            	entry.target_pos_d = prev_target_d;
								entry.stepper_mul_d = 0;
								entry.stepper_div_d = 1;
							}

                            entry.wait_for_index_zero = (flags & WAIT_FLAG) ? 1 : 0;

                            if (entry.stepper_mul_z < 0 ||
                                entry.stepper_mul_x < 0 ||
                                entry.stepper_mul_d < 0 ||
                                entry.stepper_div_z <= 0 ||
                                entry.stepper_div_x <= 0 ||
                                entry.stepper_div_d <= 0) {
                                send_invalid_response();
                                break;
                            }

                            int32_t gcd_z = gcd(entry.stepper_mul_z, entry.stepper_div_z); 
                            entry.stepper_mul_z /= gcd_z; entry.stepper_div_z /= gcd_z;
                            int32_t gcd_x = gcd(entry.stepper_mul_x, entry.stepper_div_x); 
                            entry.stepper_mul_x /= gcd_x; entry.stepper_div_x /= gcd_x;
                            int32_t gcd_d = gcd(entry.stepper_mul_d, entry.stepper_div_d); 
                            entry.stepper_mul_d /= gcd_d; entry.stepper_div_d /= gcd_d;
                                                
							// push cycle
							cycle_buffer.push(entry);

                            if (cycle_buffer.atlimit()) {
                                ok_to_run = false;
                            }
							
                            if (ok_to_run) {
                                send_ok_response();
                            } else {
                            	cycle_buffer.clear();
								send_invalid_response();
                            }
                        } break;

                // Reset to zero
                case 'R': {
                            set_zero_pos();
                            send_ok_response();
                        } break;

                // Get raw status
                case 'S': {
							int16_t cnt = qep_counter();

                            static uint8_t sts[96] = { 0 };
                            size_t pos = 0;
                            
