tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
    RCC->APB1ENR |= RCC_AHB1ENR_GPIOAEN; // enable GPIO clock for Port A

    GPIOA->MODER &= ~(GPIO_MODER_MODER9);  // reset PA9
    GPIOA->MODER &= ~(GPIO_MODER_MODER10);  // reset PA10

    GPIOA->MODER |= GPIO_MODER_MODER9_1; // Set to alt mode
    GPIOA->MODER |= GPIO_MODER_MODER10_1; // Set to alt mode

    GPIOA->AFR[1] &= ~(GPIO_AFRH_AFRH1);
    GPIOA->AFR[1] &= ~(GPIO_AFRH_AFRH2);

    GPIOA->AFR[1] |= GPIO_AFRH_AFRH1_0 | GPIO_AFRH_AFRH1_1 | GPIO_AFRH_AFRH1_2; // set to AF7 mode (USART1_TX)
    GPIOA->AFR[1] |= GPIO_AFRH_AFRH2_0 | GPIO_AFRH_AFRH2_1 | GPIO_AFRH_AFRH2_2; // set to AF7 mode (USART1_RX)

#endif  // #ifdef STM32F767xx

    // configure USART1 registers
    uint32_t baud   = (uint32_t)(SystemCoreClock/baudrate);
    USART1->BRR     = baud;
    USART1->CR1     = USART_CR1_TE | USART_CR1_RE | USART_CR1_RXNEIE | USART_CR1_UE;

    // configure NVIC
    NVIC_EnableIRQ(USART1_IRQn);
    NVIC_SetPriority(USART1_IRQn, 255);
#else  // #ifdef STM32

    uart_session = std::make_shared<uart_listener>();

#endif  // #ifdef STM32
}

static void init_qenc()
{
#ifdef STM32
    // setup A/B quadrature on timer 3 periph
    RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;  // enable TIM3 clock

#ifdef STM32F103xB
   // PA6 - A
   // PA7 - B
   // PA1 - Z
    GPIOA->CRL &= ~(GPIO_CRL_CNF6 | GPIO_CRL_MODE6);  // reset PA6
    GPIOA->CRL &= ~(GPIO_CRL_CNF7 | GPIO_CRL_MODE7);  // reset PA7

    GPIOA->CRL |= GPIO_CRL_CNF6_1;
    GPIOA->CRL |= GPIO_CRL_CNF7_1;
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
   // PA6 - A (CN12 -> Pin 13)
   // PA7 - B (CN12 -> Pin 15)
   // PA1 - Z (CN11 -> Pin 30)
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;

    GPIOA->MODER &= ~(GPIO_MODER_MODER6);  // reset PA6
    GPIOA->MODER &= ~(GPIO_MODER_MODER7);  // reset PA7

    GPIOA->MODER |= GPIO_MODER_MODER6_1;
    GPIOA->MODER |= GPIO_MODER_MODER7_1;
    
    GPIOA->AFR[0] &= ~(GPIO_AFRL_AFRL6); 
    GPIOA->AFR[0] &= ~(GPIO_AFRL_AFRL7);

    GPIOA->AFR[0] |= GPIO_AFRL_AFRL6_2;
    GPIOA->AFR[0] |= GPIO_AFRL_AFRL7_2;
#endif  // #ifdef STM32F767xx

    TIM3->SR = 0;
    TIM3->CNT = 0;

    TIM3->CCMR1 &= ~(TIM_CCMR1_CC1S); 
    TIM3->CCMR1 |= TIM_CCMR1_CC1S_0; // connect TI1

    TIM3->CCMR1 &= ~(TIM_CCMR1_CC2S);
    TIM3->CCMR1 |= TIM_CCMR1_CC2S_0; // connect TI2

    TIM3->CCER &= ~(TIM_CCER_CC1P);  
    TIM3->CCER &= ~(TIM_CCER_CC1NP); 

    TIM3->CCER &= ~(TIM_CCER_CC2P);
    TIM3->CCER &= ~(TIM_CCER_CC2NP); 

    TIM3->SMCR &= ~(TIM_SMCR_SMS);
    TIM3->SMCR |= TIM_SMCR_SMS_0 | TIM_SMCR_SMS_1;

    TIM3->CR1  |= TIM_CR1_CEN; // turn on counter

    NVIC_EnableIRQ(TIM3_IRQn);
    NVIC_SetPriority(TIM3_IRQn, 3);

#ifdef STM32F103xB
    // setup Z/Index on pin PA1
    RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;  // enable AFIO clock
    AFIO->EXTICR[0] |= AFIO_EXTICR1_EXTI1_PA; // Select EXT1
#endif  // #ifdef STM32F103xB

#ifdef STM32F767xx
	RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN; // enable SYCFG clock
    SYSCFG->EXTICR[0] |= SYSCFG_EXTICR1_EXTI1_PA; // Select EXT1
#endif  // #ifdef STM32F767xx

    EXTI->IMR |= EXTI_IMR_MR1;
    EXTI->FTSR |= EXTI_FTSR_TR1;

    // configure NVIC
    NVIC_EnableIRQ(EXTI1_IRQn);
    NVIC_SetPriority(EXTI1_IRQn, 0); // highest/critical priority in system

#else  // #ifdef STM32

    qenc_session = std::make_shared<qenc_timer>();

#endif  // #ifdef STM32
}

static void init_stepper_pins()
{
#ifdef STM32
#ifdef STM32F103xB
    RCC->APB2ENR |= RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPAEN; // Enable GPIOB and GPIOA block

    // Z - enable
    GPIOB->CRH &= ~(GPIO_CRH_MODE12 | GPIO_CRH_CNF12);
    GPIOB->CRH |= GPIO_CRH_MODE12_1 | GPIO_CRH_MODE12_0;
    PIN_ENA_0_X; // set to low enables driver

    // Z - pulse/step
    GPIOB->CRH &= ~(GPIO_CRH_MODE13 | GPIO_CRH_CNF13);
    GPIOB->CRH |= GPIO_CRH_MODE13_1 | GPIO_CRH_MODE13_0;
    PIN_PUL_1_Z;

    // Z - dir
    GPIOB->CRH &= ~(GPIO_CRH_MODE14 | GPIO_CRH_CNF14);
    GPIOB->CRH |= GPIO_CRH_MODE14_1 | GPIO_CRH_MODE14_0;
    PIN_DIR_1_Z;

    // X - enable
    GPIOB->CRH &= ~(GPIO_CRH_MODE15 | GPIO_CRH_CNF15);
    GPIOB->CRH |= GPIO_CRH_MODE15_1 | GPIO_CRH_MODE15_0;
    PIN_ENA_0_X; // set to low enables driver

    // X - pulse/step
    GPIOB->CRH &= ~(GPIO_CRH_MODE11 | GPIO_CRH_CNF11);
    GPIOB->CRH |= GPIO_CRH_MODE11_1 | GPIO_CRH_MODE11_0;
    PIN_PUL_1_X;

    // X - dir
    GPIOB->CRL &= ~(GPIO_CRL_MODE5 | GPIO_CRL_CNF5);
    GPIOB->CRL |= GPIO_CRL_MODE5_1 | GPIO_CRL_MODE5_0;
    PIN_DIR_1_X;
#endif   // #ifdef STM32F103xB

#ifdef STM32F767xx
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;

    // Z - enable
    GPIOE->MODER &= ~(GPIO_MODER_MODER9); 
    GPIOE->MODER |= GPIO_MODER_MODER9_1; // output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR9); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR9_1; // high speed 
    PIN_ENA_0_X; // set to low enables driver

    // Z - pulse/step
    GPIOE->MODER &= ~(GPIO_MODER_MODER10); 
    GPIOE->MODER |= GPIO_MODER_MODER10_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR10); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR10_1; // high speed 
    PIN_PUL_1_Z;

    // Z - dir
    GPIOE->MODER &= ~(GPIO_MODER_MODER11); 
    GPIOE->MODER |= GPIO_MODER_MODER11_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR11); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR11_1; // high speed  
    PIN_DIR_1_Z;

    // X - enable
    GPIOE->MODER &= ~(GPIO_MODER_MODER12); 
    GPIOE->MODER |= GPIO_MODER_MODER12_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR12); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR12_1; // high speed 
    PIN_ENA_0_X; // set to low enables driver

    // X - pulse/step
    GPIOE->MODER &= ~(GPIO_MODER_MODER13);
    GPIOE->MODER |= GPIO_MODER_MODER13_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR13); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR13_1; // high speed 
    PIN_PUL_1_X;

    // X - dir
    GPIOE->MODER &= ~(GPIO_MODER_MODER14);
    GPIOE->MODER |= GPIO_MODER_MODER14_1;// output mode 
    GPIOE->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR14); 
    GPIOE->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR14_1; // high speed 
    PIN_DIR_1_X;
#endif   // #ifdef STM32F767xx
#endif  // #ifdef STM32
}

